hare-siterwell/STM32_PIO/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"
#include "stm32h7xx_ll_dma.h"
#include "stm32h7xx_ll_lpuart.h"
#include "stm32h7xx_ll_rcc.h"
#include "stm32h7xx_ll_crs.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_system.h"
#include "stm32h7xx_ll_exti.h"
#include "stm32h7xx_ll_cortex.h"
#include "stm32h7xx_ll_utils.h"
#include "stm32h7xx_ll_pwr.h"
#include "stm32h7xx_ll_tim.h"
#include "stm32h7xx_ll_usart.h"
#include "stm32h7xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY_Pin LL_GPIO_PIN_13
#define KEY_GPIO_Port GPIOC
#define RED_Pin LL_GPIO_PIN_0
#define RED_GPIO_Port GPIOC
#define GREEN_Pin LL_GPIO_PIN_1
#define GREEN_GPIO_Port GPIOC
#define BLUE_Pin LL_GPIO_PIN_2
#define BLUE_GPIO_Port GPIOC
#define MOTOR1_DIR_Pin LL_GPIO_PIN_0
#define MOTOR1_DIR_GPIO_Port GPIOA
#define MOTOR1_MS1_Pin LL_GPIO_PIN_1
#define MOTOR1_MS1_GPIO_Port GPIOA
#define MOTOR1_MS2_Pin LL_GPIO_PIN_2
#define MOTOR1_MS2_GPIO_Port GPIOA
#define MOTOR1_MS3_Pin LL_GPIO_PIN_3
#define MOTOR1_MS3_GPIO_Port GPIOA
#define MOTOR1_STEP_Pin LL_GPIO_PIN_6
#define MOTOR1_STEP_GPIO_Port GPIOA
#define LCD_PWR_Pin LL_GPIO_PIN_3
#define LCD_PWR_GPIO_Port GPIOD
#define LCD_RST_Pin LL_GPIO_PIN_4
#define LCD_RST_GPIO_Port GPIOD
#define LCD_DC_Pin LL_GPIO_PIN_4
#define LCD_DC_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
